---
type: FilterOperatorAndTextString
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FilterOperatorAndTextString

`Autodesk.Revit.DB.FilterOperatorAndTextString` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FilterOperatorStr | 2019 | `public string FilterOperatorStr { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OperatorType | 2019 | `public ScheduleFilterType OperatorType { get ; }` |